.emacs.d.new/config.el
;;Bootstrap use-package
(require 'package)
(add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  (setq use-package-always-ensure t
        use-package-expand-minimally t))

  ;;Add straight 
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

  ;; tells straight where to find the vertico extensions, orignally was (straight-use-package 'use-package)
(straight-use-package '(vertico :files (:defaults "extensions/*")
                        :includes (vertico-buffer
                                   vertico-directory
                                   vertico-flat
                                   vertico-indexed
                                   vertico-mousen
                                   vertico-quick
                                   vertico-repeat
                                   vertico-reverse)))
(setq straight-use-package-by-default t)

;;Personal Info
(setq user-full-name "William Swaney"
      user-mail-address "the2bears@gmail.com")

  ;;This helps speed up loading
(eval-and-compile
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6))

  ;;Sets the custom file so emacs won't write to init.el
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

  ;;globals
(global-auto-revert-mode)
(global-hl-line-mode +1)
  
  ;;Basic settings and properties
(setq auto-revert-verbose nil
      explicit-shell-file-name "/bin/zsh"
      inhibit-startup-message t
      visible-bell nil)
(save-place-mode 1)
(tool-bar-mode -1) 

  ;;For Mac(?)
(toggle-frame-fullscreen)
(use-package exec-path-from-shell
  :straight t
  :init
  (exec-path-from-shell-initialize))

(defalias 'yes-or-no-p 'y-or-n-p)

;; ========
      ;; diminish
      ;; ========
