.emacs.d.new/config.el
      ;;This package implements hiding or abbreviation of the mode line displays (lighters) of minor-modes.
(use-package diminish
    :straight t)

  ;; =========
  ;; undo-tree
  ;; =========
(use-package undo-tree
  :straight t
  :diminish undo-tree-mode
  :init
  (global-undo-tree-mode)
  :custom
  (undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))

  ;; ==========
  ;; marginalia
  ;; ==========
  ;; Enable richer annotations in minibuffers using the Marginalia package
(use-package marginalia
  :straight t
  :ensure t
  :after vertico
  ;; Either bind `marginalia-cycle` globally or only in the minibuffer
  :bind (("M-A" . marginalia-cycle)
         :map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  ;; The :init configuration is always executed (Not lazy!)
  :init
  (marginalia-mode))

  ;; =========
  ;; which-key
  ;; =========
  ;; A minor mode for Emacs that displays the key bindings following your currently entered incomplete command
(use-package which-key
  :straight t
  :diminish which-key-mode
  :init
  (which-key-mode +1))

  ;; =============
  ;; expand-region
  ;; =============
  ;; Expand region increases the selected region by semantic units. 
(use-package expand-region
  :straight t
  :ensure t
  :bind ("C-=" . er/expand-region))


  ;; =======
  ;; company
  ;; =======
  ;; Stands for 'complete anything' and is a completion framework.
(use-package company
  :straight t
  :diminish company-mode
  :init
  (global-company-mode 1)
  (setq company-idle-delay 0.5)
  (setq company-show-numbers t)
  (setq company-tooltip-limit 10)
  (setq company-minimum-prefix-length 2)
  (setq company-tooltip-align-annotations t)
  (setq company-backends '((company-capf company-dabbrev-code))))

  ;; =========
  ;; prescient  
  ;; =========
  ;; A library which sorts and filters lists of candidates - w/company
(use-package company-prescient
  :straight t
  :after company
  :config
  (company-prescient-mode 1)
  (prescient-persist-mode 1))

  ;; =======
  ;; vertico
  ;; =======
  ;; For mini-buffer completion
(use-package vertico
  :straight t
  :init
  (vertico-mode))
    ;; Configure directory extension.
(use-package vertico-directory
  :straight t
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

    ;; =========
    ;; orderless
    ;; =========
    ;; added completion styles
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

  ;; ========
  ;; savehist
  ;; ========
  ;;built in savehist remembers previous selections in mini-buffer selections
(use-package savehist
  :init
  (savehist-mode))

  ;; ======
  ;; embark
  ;; ======
  ;; context actions... normally we have function->obj but this also adds
  ;; obj->function work flow
(use-package embark
  :straight t
  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

  ;; =======
  ;; consult
  ;; =======
  ;; Example configuration for Consult
(use-package consult
  :straight t
  :ensure t
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind (;;("C-x b" . consult-buffer)
         ;;("C-x C-b" . consult-buffer)
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ("M-s g" . consult-grep)))

  ;; ==========
  ;; super-save
  ;; ==========
  ;; saves buffers when they lose focus
(use-package super-save
  :straight t
  :diminish super-save-mode
  :config
  (super-save-mode +1))

  ;; ====
  ;; helm
  ;; ====
  ;; framework for incremental completions and narrowing selections.
(use-package helm
  :straight t)

  ;; ================
  ;; multiple-cursors
  ;; ================
  ;; Multiple cursors for Emacs
(use-package multiple-cursors
  :straight t)

  ;; ======
  ;; swiper
  ;; ======
  ;; for searching - TODO add swiper-helm?
(use-package swiper
  :straight t
  :config (global-set-key (kbd "C-s") 'swiper))

;;Load the theme
(load-theme 'modus-vivendi t)
(setq modus-themes-org-blocks 'gray-background)

(use-package rainbow-delimiters
  :straight t
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
