.emacs.d.new/config.org
*** Org-mode settings
#+begin_src emacs-lisp

  (defun t2b/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq org-directory "~/.org"))

  ;;(setq org-directory "~/.org")
  (use-package org
    :hook (org-mode . t2b/org-mode-setup)
    :ensure t
    :defer t
    :config
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-src-fontify-natively t
          org-fontify-quote-and-verse-blocks t
          org-src-tab-acts-natively t
          org-edit-src-content-indentation 2
          org-hide-block-startup t
          org-src-preserve-indentation nil
          org-startup-folded 'content
          org-cycle-separator-lines 2))

  (use-package org-bullets
    :straight t
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  ;;https://emacs.stackexchange.com/questions/71714/how-do-i-define-default-language-for-org-mode-source-code-blocks
  (require 'org-tempo)

  (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.3)
  (dolist (face '((org-level-1 . 1.6)
                  (org-level-2 . 1.4)
                  (org-level-3 . 1.2)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)
                  (org-link . 1.1)                  
                  (org-block-begin-line . 1.1)))
    (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face)))

        ;; Make sure org-indent face is available
  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :height 1.2 :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

        ;; Get rid of the background on column views
  (set-face-attribute 'org-column nil :background nil)
  (set-face-attribute 'org-column-title nil :background nil)


  (when (not (file-exists-p "~/.org"))
    (make-directory "~/.org" t))

;;  (setq org-agenda-files (append (directory-files-recursively "~/org-mode_workspace/" "\\.org$")
;;                                 (directory-files-recursively "~/.org/" "\\.org$")))

  (defun t2b/org-mode-agenda-files-update ()
    (setq org-agenda-files (append (directory-files-recursively "~/org-mode_workspace/" "\\.org$")
                                 (directory-files-recursively "~/.org/" "\\.org$"))))

  ;;(add-hook 'org-capture-after-finalize-hook 't2b/org-mode-agenda-files-update)
  ;;(remove-hook 'org-capture-after-finalize-hook 't2b/org-mode-agenda-files-update)

  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c a") 'org-agenda)
  
  (setq org-capture-templates `(("t" "Todo [monthly]" entry
                                 (file+headline ,(format-time-string "~/.org/tasks/tasks-%Y-%b.org") ,(format-time-string "%Y-%b-%d"))
                                 "* TODO %i%?")
                                ("T" "Tickler" entry
                                 (file+headline "~/.org/tickler.org" "Tickler")
                                 "* %i%? \n %U")))

#+end_src

*** Org-babel
#+begin_src emacs-lisp

  ;;Auto-tangle
  (use-package org-auto-tangle
    :straight t
    :defer t
    :hook (org-mode . org-auto-tangle-mode)
    :config
    (setq org-auto-tangle-default t))
  
#+end_src

*** Org-roam
#+begin_src emacs-lisp

    ;;start personal functions
    (defun t2b/org-file-tags-from-file (filename)
      "Return a list of filetags present in the Org mode file FILENAME."
      (with-current-buffer (find-file-noselect filename)
        (save-excursion
          (goto-char (point-min))
          (let ((filetags '()))
            (while (re-search-forward "^#\\+filetags:\\s-+\\(.*\\)" nil t)
              (message (match-string 1))
              (setq filetags (append filetags (split-string (match-string 1) ":"))))
            filetags))))

    (defun t2b/org-filetag-exists-p (filename filetag)
      "Return t if FILETAG exists in the Org mode file FILENAME, otherwise nil."
      (let ((filetags (t2b/org-file-tags-from-file filename)))
        (member filetag filetags)))

    (defun t2b/org-roam-agenda-update ()
      (let ((s (buffer-file-name (org-capture-get :buffer))))
        (when (t2b/org-filetag-exists-p s "project")
          (add-to-list 'org-agenda-files s))))

    ;;(setq org-agenda-files '())
    ;;(setq org-capture-after-finalize-hook '())

    ;;(t2b/org-roam-agenda-update)
    ;;end personal functions
    (add-hook 'org-capture-after-finalize-hook 't2b/org-roam-agenda-update)

    (use-package org-roam
      :straight t
      :ensure t
      :init (setq org-roam-v2-ack t)
      :custom
      (org-roam-directory "~/.roam")
      (org-roam-completion-everywhere t)
      (org-roam-capture-templates
       '(("d" "default" plain
          "%?"
          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
          :unnarrowed t)
         ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Initial tasks for ${title}\n\n* Dates\n\n"
          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" ":PROPERTIES:\n:CATEGORY: %^{CATEGORY}\n:PARENT: %^{PARENT}\n:END:\n#+title: ${title}\n#+filetags: project")
          :unnarrowed t)))
      :bind
      (("C-c r l" . org-roam-buffer-toggle)
       ("C-c r f" . org-roam-node-find)
       ("C-c r i" . org-roam-node-insert)
       ("C-c r c" . org-roam-capture)
       ;;Dailies
       ("C-c r j" . org-roam-dailies-capture-today)
       :map org-mode-map ("C-M-i" . completion-at-point))
      :config
      (org-roam-db-autosync-mode)
      (org-roam-setup))

  #+end_src
** Development
*** General
#+begin_src  emacs-lisp

  ;; =====
  ;; magit
  ;; =====
  ;; best. git. client. ever.
  (use-package magit
    :straight t
    :ensure t
    :bind (("C-x g" . magit-status)))

  ;; ===========
  ;; magit-delta
  ;; ===========
  ;; using 'delta' for git diffs
  (use-package magit-delta
    :straight t
    :ensure t
    :after magit
    :hook (magit-mode . magit-delta-mode))

  ;; ===============
  ;; git-timemachine
  ;; ===============
  ;; move back and forth between revisions of a git controlled file
  ;;  (use-package git-timemachine
  ;;    :straight t
  ;;    :ensure t
  ;;    :bind (("C-x gt" . git-timemachine)))

  ;; ========
  ;; parinfer
  ;; ========
  ;; parentheses management
  (use-package parinfer-rust-mode
    :straight t
    :hook emacs-lisp-mode clojure-mode
    :ensure t
    :init
    (setq parinfer-rust-auto-download t))

  ;; Enable nice rendering of diagnostics like compile errors.
  (use-package flycheck
    :straight t
    :diminish flycheck-mode
    :init (global-flycheck-mode))
  (use-package projectile
    :straight t
    :diminish projectile-mode
    :init (projectile-mode +1)
    :config
    (define-key
      projectile-mode-map
      (kbd "C-c p")
      'projectile-command-map))
  (use-package yasnippet
    :straight t
    :diminish yas-minor-mode
    :config (yas-global-mode))
  (use-package hydra
    :straight t)

  ;; ========
  ;; hideshow
  ;; ========
  ;;(add-hook 'java-mode-hook 'hs-minor-mode)
  (add-hook 'java-mode-hook
  (lambda()
    (local-set-key (kbd "C-<right>") 'hs-show-block)
    (local-set-key (kbd "C-<left>")  'hs-hide-block)
    ;;(local-set-key (kbd "C-c <up>")    'hs-hide-all)
    ;;(local-set-key (kbd "C-c <down>")  'hs-show-all)
    (hs-minor-mode t)))
  (defun display-code-line-counts (ov)
    (when (eq 'code (overlay-get ov 'hs))
      (overlay-put ov 'help-echo
                (buffer-substring (overlay-start ov)
  		                (overlay-end ov)))))

  (setq hs-set-up-overlay 'display-code-line-counts)
#+end_src
*** LSP and DAP
#+begin_src emacs-lisp 
  (use-package lsp-mode
    :ensure t
    ;; Optional - enable lsp-mode automatically in scala files
    :hook ;;(scala-mode . lsp-deferred)
          (lsp-mode . lsp-lens-mode)
          (lsp-mode . lsp-enable-which-key-integration)
    :config
    ;; Uncomment following section if you would like to tune lsp-mode performance according to
    ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
    ;;       (setq gc-cons-threshold 100000000) ;; 100mb
    ;;       (setq read-process-output-max (* 1024 1024)) ;; 1mb
    ;;       (setq lsp-idle-delay 0.500)
    ;;       (setq lsp-log-io nil)
    (setq lsp-prefer-flymake nil
          lsp-client-packages '(lsp-clients lsp-metals)))

    ;;(use-package company-lsp
    ;;  :ensure t)

    ;; Enable nice rendering of documentation on hover
    ;;   Warning: on some systems this package can reduce your emacs responsiveness significally.
    ;;   (See: https://emacs-lsp.github.io/lsp-mode/page/performance/)
    ;;   In that case you have to not only disable this but also remove from the packages since
    ;;   lsp-mode can activate it automatically.
  (use-package lsp-ui
    :straight t
    :ensure t)
  (use-package dap-mode
    :after lsp-mode
    :config (dap-auto-configure-mode))
  (use-package dap-java
    :straight f
    :ensure nil)

  ;; for Prolog
  (lsp-register-client
   ;;(message "t2b/prolog-lsp-fn()")
    (make-lsp-client
     :new-connection
     (lsp-stdio-connection (list "swipl"
                              "-g" "use_module(library(lsp_server))."
                              "-g" "lsp_server:main"
                              "-t" "halt"
                              "--" "stdio")) 
     :major-modes '(prolog-mode)
     :priority 1
     :multi-root t
     :server-id 'prolog-ls))


  (use-package prolog
    :ensure t
    :config (add-hook 'prolog-mode-hook 'lsp))
  (setq auto-mode-alist (append '(("\\.pl$" . prolog-mode))
                               auto-mode-alist))


#+end_src
