.emacs.d.new/config.el

(defun t2b/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1))

(use-package org
  :hook (org-mode . t2b/org-mode-setup)
  :ensure t
  :defer t
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup t
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2))

(use-package org-bullets
  :straight t
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(require 'org-tempo)

(set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.3)
(dolist (face '((org-level-1 . 1.6)
                (org-level-2 . 1.4)
                (org-level-3 . 1.2)
                (org-level-4 . 1.1)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)
                (org-link . 1.1)                  
                (org-block-begin-line . 1.1)))
  (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face)))

      ;; Make sure org-indent face is available
(require 'org-indent)

      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :height 1.2 :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

      ;; Get rid of the background on column views
(set-face-attribute 'org-column nil :background nil)
(set-face-attribute 'org-column-title nil :background nil)


(when (not (file-exists-p "~/.org"))
  (make-directory "~/.org" t))

(setq org-agenda-files (append (directory-files-recursively "~/org-mode_workspace/" "\\.org$")
                               (directory-files-recursively "~/.org/" "\\.org$")))

(global-set-key (kbd "C-c c") 'org-capture)

(setq org-capture-templates '(("t" "Todo [inbox]" entry
                               (file+headline "~/.org/inbox.org" "Tasks")
                               "* TODO %i%?")
                              ("T" "Tickler" entry
                               (file+headline "~/.org/tickler.org" "Tickler")
                               "* %i%? \n %U")))

;;Auto-tangle
(use-package org-auto-tangle
  :straight t
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

;;Magit, best. git. client. ever.
(use-package magit
  :straight t
  :ensure t
  :bind (("C-x g" . magit-status)))
  ;;parinfer
(use-package parinfer-rust-mode
  :straight t
  :hook emacs-lisp-mode clojure-mode
  :ensure t
  :init
  (setq parinfer-rust-auto-download t))
  ;; Enable nice rendering of diagnostics like compile errors.
(use-package flycheck
  :straight t
  :diminish flycheck-mode
  :init (global-flycheck-mode))
(use-package projectile
  :straight t
  :diminish projectile-mode
  :init (projectile-mode +1)
  :config
  (define-key
    projectile-mode-map
    (kbd "C-c p")
    'projectile-command-map))
(use-package yasnippet
  :straight t
  :diminish yas-minor-mode
  :config (yas-global-mode))
(use-package hydra
  :straight t)

(use-package lsp-mode
  :ensure t
  ;; Optional - enable lsp-mode automatically in scala files
  :hook ;;(scala-mode . lsp-deferred)
        (lsp-mode . lsp-lens-mode)
        (lsp-mode . lsp-enable-which-key-integration)
  :config
  ;; Uncomment following section if you would like to tune lsp-mode performance according to
  ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
  ;;       (setq gc-cons-threshold 100000000) ;; 100mb
  ;;       (setq read-process-output-max (* 1024 1024)) ;; 1mb
  ;;       (setq lsp-idle-delay 0.500)
  ;;       (setq lsp-log-io nil)
  (setq lsp-prefer-flymake nil
        lsp-client-packages '(lsp-clients lsp-metals)))

  ;;(use-package company-lsp
  ;;  :ensure t)

  ;; Enable nice rendering of documentation on hover
  ;;   Warning: on some systems this package can reduce your emacs responsiveness significally.
  ;;   (See: https://emacs-lsp.github.io/lsp-mode/page/performance/)
  ;;   In that case you have to not only disable this but also remove from the packages since
  ;;   lsp-mode can activate it automatically.
(use-package lsp-ui
  :straight t
  :ensure t)
(use-package dap-mode
  :after lsp-mode
  :config (dap-auto-configure-mode))
(use-package dap-java
  :straight f
  :ensure nil)

;;clojure-mode
