.emacs.d.new/config.el
(use-package clojure-mode
  :straight t)
  ;;cider
(use-package cider
  :straight t)
  ;;:init
  ;;(add-hook 'cider-repl-mode-hook #'company-mode)
  ;;(add-hook 'cider-mode-hook #'company-mode)
  ;;(add-hook 'clojure-mode-hook #'company-mode))

;; Enable scala-mode for highlighting, indentation and motion commands
(use-package scala-mode
  :straight t
  :ensure t
  :interpreter
  ("scala" . scala-mode))

  ;; Enable sbt mode for executing sbt commands
(use-package sbt-mode
  :straight t
  :ensure t
  :commands sbt-start sbt-command
  :config
  ;; WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31
  ;; allows using SPACE when in the minibuffer
  (substitute-key-definition
   'minibuffer-complete-word
   'self-insert-command
   minibuffer-local-completion-map)
  ;; sbt-supershell kills sbt-mode:  https://github.com/hvesalai/emacs-sbt-mode/issues/152
  (setq sbt:program-options '("-Dsbt.supershell=false")))

  ;; Add metals backend for lsp-mode
(use-package lsp-metals
  :straight t
  :ensure t
  :config
  (add-hook 'scala-mode-hook 'lsp))

(use-package lsp-java
  :ensure t
  :init
  (setq lsp-completion-provider :capf)
  (setq lsp-java-imports-gradle-wrapper-checksums [(
                                                    :sha256 "c8f4be323109753b6b2de24a5ca9c5ed711270071ac14d0718229cbc77236f48"
                                                    :allowed t)])
  :config
  (add-hook 'java-mode-hook 'lsp))

;;Revert back so no long GC pauses during runtime
(setq gc-cons-threshold 16777216
      gc-cons-percentage 0.1)
